from omc.models import UserIngredient

def run():
    types = ['가공/유제품','채소','해산물','육류','햄/소시지','곡물','곡물분말','면','콩/견과류','빵/떡','과일','조미료/양념']

    user_ingredients=[
        ['계란', '메추리알', '모짜렐라 치즈', '체다치즈', '요거트', '생크림', '돈까스', '만두', '물만두', '옥수수콘', '참치캔'],
        ['가지', '고추', '깻잎', '당근', '대파', '마늘', '무', '배추', '브로콜리', '비트', '상추', '샐러리', '시금치', '아스파라거스', '애호박', '양배추', '호박', '양파', '열무', '오이', '토마토', '파프리카', '양송이 버섯', '팽이버섯', '표고버섯'],
        ['갈치', '고등어', '꽁치', '도다리', '동태', '멸치', '명태', '아귀', '연어', '전어', '조기', '새우', '건새우', '꽃게', '게맛살', '낙지', '문어', '오징어', '진미 오징어', '쭈꾸미', '골뱅이', '굴', '꼬막', '대합', '바지락', '소라', '전복', '조개', '홍합', '다시마', '미역', '어묵'],
        ['닭고기', '돼지고기', '오리고기', '소고기', '양고기'],
        ['베이컨', '스팸', '미트볼', '햄', '소시지', '비엔나 소시지', '순대'],
        ['감자', '고구마', '옥수수', '흑미', '귀리', '깨', '콩', '검은콩'],
        ['밀가루', '부침가루', '찹쌀가루', '빵가루', '통밀가루'],
        ['당면', '라면', '소면', '수제비', '스파게티면', '우동면', '칼국수면', '곤약면', '메밀면'],
        ['콩', '검은콩', '완두콩', '깨', '두부', '순두부', '땅콩', '아몬드', '호두', '잣'],
        ['바게트', '베이글', '식빵', '가래떡', '떡국떡', '떡볶이떡'],
        ['딸기', '감', '귤', '라임', '레몬', '오렌지', '포도', '건포도', '블루베리', '사과', '수박', '배', '체리', '키위', '자두', '파인애플', '망고', '메론', '바나나', '복숭아', '아보카도'],
        ['간장', '고추장', '고춧가루', '초고추장', '소금', '깨소금', '굵은소금', '설탕', '된장', '청국장', '쌈장', '후추', '식초', '참기름', '올리브유', '올리고당', '굴소스', '물엿', '다진마늘', '꿀', '까나리 액젓', '멸치 액젓', '미원', '쇠고기 다시다', '데리야끼 소스', '돈까스 소스', '마요네즈', '케첩', '머스타드 소스', '칠리소스', '핫소스', '토마토 소스', '카레가루', '짜장가루', '춘장', '명란젓갈', '오징어젓갈']
    ]
    for idx, t in enumerate(types):
        for user_ing in user_ingredients[idx]:
            # UserIngredient({'type': t, 'name': user_ing}).save()
            # print(t,user_ing,"saved")
            print('(\'',t,'\',\'',user_ing,'\'),',sep='')
