from omc.models import UserIngredient

def run():
    types = ['가공','유제품','채소','해산물','육류','햄/소시지','곡물','가루','면','콩/견과류','빵/떡','과일','조미료/양념','잼/청', '음료/과자']

    user_ingredients=[
        ['라이스페이퍼', '곤약','유부초밥', '도토리', '튀김','전', '낫또', '가쓰오부시', '무김치', '묵은지', '수프', '동그랑땡', '쌈무', '백김치', '돈까스', '만두', '묵', '물만두', '단무지', '피클', '마늘쫑', '유부', '옥수수콘', '참치캔', '김치'],
        ['계란', '메추리알', '모짜렐라 치즈', '체다치즈', '두유', '요구르트', '요거트', '치즈', '크림치즈', '생크림', '파마산치즈', '버터', '우유', '아이스크림', '연유'],
        ['가지','새싹','나물', '숙주', '버섯', '고추', '느타리버섯', '피망', '연근', '바닐라빈', '깻잎', '삼', '더덕', '치커리', '봄동', '목이버섯', '새송이버섯', '당근', '채소', '냉이', '루꼴라', '달래', '쪽파', '대파', '바질', '우엉', '도라지', '시래기', '쑥갓', '마늘', '무', '배추', '브로콜리', '청경채', '월계수', '양상추', '미나리', '비트', '단호박', '생강', '상추', '샐러리', '콩나물', '부추', '시금치', '아스파라거스', '애호박', '양배추', '호박', '양파', '열무', '오이', '토마토', '파프리카', '양송이 버섯', '팽이버섯', '표고버섯', '고수'],
        ['갈치', '고등어', '꽁치', '동태', '멸치', '랍스터', '명태', '명란', '아귀', '날치알', '생선', '해조류', '칵테일새우', '연어', '건어물', '조기', '새우', '김', '건새우', '할라피뇨', '북어', '가자미', '해산물', '삼치', '꽃게', '게맛살', '낙지', '황태', '문어', '오징어', '진미 오징어', '쭈꾸미', '골뱅이', '굴', '꼬막', '대합', '바지락', '소라', '전복', '조개', '홍합', '다시마', '미역', '어묵'],
        ['닭고기', '돼지고기', '오리고기', '소고기'],
        ['베이컨', '스팸', '떡갈비', '햄', '소시지', '비엔나 소시지', '순대'],
        ['감자', '고구마', '옥수수', '흑미','잡곡', '찹쌀', '귀리','쌀', '밥', '누룽지'],
        ['밀가루', '부침가루', '전분가루', '튀김가루', '빵가루', '통밀가루', '코코아가루', '핫케이크가루', '찹쌀가루', '효모', '베이킹믹스', '베이킹소다', '치킨가루', '쌀가루', '콩가루', '미숫가루', '슈가파우더', '황치즈가루', '베이킹파우더', '한천가루', '마늘가루', '시나몬', '생강가루'],
        ['당면', '라면', '소면', '면', '스파게티면', '우동면', '중면', '칼국수면', '쌀국수면', '쫄면', '메밀면'],
        ['콩', '검은콩', '완두콩', '깨', '두부', '순두부', '땅콩', '아몬드', '견과류', '호두', '팥', '잣', '흑임자'],
        ['바게트', '베이글', '식빵', '빵', '가래떡', '떡', '떡국떡', '떡볶이떡', '또띠아', '카스테라', '모닝빵'],
        ['딸기', '감', '귤', '레몬', '오렌지', '포도', '블루베리', '사과', '수박', '대추', '건포도', '배', '체리', '코코넛', '키위','올리브', '씨앗', '자두', '파인애플', '망고', '과일', '매실', '바나나', '복숭아', '밤', '아보카도', '건과일'],
        ['간장', '고추장', '고춧가루', '고추기름', '와사비', '초고추장', '들기름', '발사믹', '소금', '조미료', '깨소금', '양념장', '소스', '드레싱', '바닐라익스트랙', '스테이크 소스', '굵은소금', '향신료', '두반장', '후리가케', '오리엔탈소스', '치킨스톡', '설탕', '된장', '청국장', '맛술', '파슬리', '레몬즙', '새우젓', '쌈장', '후추', '식초', '참기름', '올리브유', '올리고당', '굴소스', '물엿', '다진생강', '다진마늘', '꿀', '까나리 액젓', '멸치 액젓', '쇠고기 다시다', '데리야끼 소스', '돈까스 소스', '마요네즈', '케첩', '머스타드 소스', '칠리소스', '핫소스', '토마토 소스', '카레가루', '짜장가루', '춘장', '명란젓갈', '오징어젓갈', '겨자', '식용유'],
        ['잼', '매실청', '시럽', '식용색소', '유자청', '누텔라잼', '딸기잼', '땅콩잼' ],
        ['녹차', '시리얼', '탄산음료', '얼그레이', '초코칩', '과자', '주스', '럼주', '커피', '마시멜로우', '오레오', '젤리', '스프링클', '다이제', '와인', '맥주', '음료수', '청주',]
    ]
    for idx, t in enumerate(types):
        for user_ing in user_ingredients[idx]:
            UserIngredient(**{'type': t, 'name': user_ing}).save()
            print(t,user_ing,"saved")
